gmanfredax/nsalarmpro-workspace/NSAlarmPro.ioc
#MicroXplorer Configuration settings - do not modify
File.Version=6
Device=STM32F407VETx
ProjectManager.AskForMcu=0
ProjectManager.BackupPrevious=false
ProjectManager.CompilerOptimize=6
ProjectManager.ProjectBuild=false
ProjectManager.ProjectName=NSAlarmPro
ProjectManager.ProjectPath=.
ProjectManager.TargetToolchain=STM32CubeIDE
ProjectManager.ToolChainLocation=
RCC.AHBFreq_Value=168000000
RCC.APB1Freq_Value=42000000
RCC.APB2Freq_Value=84000000
RCC.HCLKFreq_Value=168000000
RCC.SYSCLKFreq_VALUE=168000000
FREERTOS.Footprint=Heap4
FREERTOS.HeapSize=98304
FREERTOS.IPCQueueSize=16
FREERTOS.KernelTickFrequency=1000
FREERTOS.TimeSlice=1
FREERTOS.configUSE_NEWLIB_REENTRANT=1
ETH.IPParameters=MediaInterface,MACAddress,RMIIRefClk
eTH.MediaInterface=RMII
ETH.MACAddress=02:80:E1:00:00:00
ETH.RMIIRefClk=RMII_REF_CLK_Pin
LWIP.AppType=HTTPD
LWIP.DHCP=Enabled
LWIP.HTTPD=Enabled
LWIP.HTTPDSSI=Enabled
LWIP.HTTPDCGI=Enabled
LWIP.LwipStack=Enabled
LWIP.NetifLinkCallback=Enabled
LWIP.NetifStatusCallback=Enabled
LWIP.UseRawAPI=Enabled
LWIP.UDP=Enabled
LWIP.TCP=Enabled
LWIP.SNMP=Disabled
LWIP.DNS=Enabled
LWIP.MQTT=Disabled
ADC1.Channel-0#ChannelRegularConversion=ADC_CHANNEL_0
ADC1.Channel-1#ChannelRegularConversion=ADC_CHANNEL_3
ADC1.Channel-2#ChannelRegularConversion=ADC_CHANNEL_4
ADC1.Channel-3#ChannelRegularConversion=ADC_CHANNEL_5
ADC1.Channel-4#ChannelRegularConversion=ADC_CHANNEL_6
ADC1.Channel-5#ChannelRegularConversion=ADC_CHANNEL_8
ADC1.Channel-6#ChannelRegularConversion=ADC_CHANNEL_9
ADC1.Channel-7#ChannelRegularConversion=ADC_CHANNEL_10
ADC1.Channel-8#ChannelRegularConversion=ADC_CHANNEL_12
ADC1.Channel-9#ChannelRegularConversion=ADC_CHANNEL_13
ADC1.Channel-10#ChannelRegularConversion=ADC_CHANNEL_VBAT
ADC1.Channel-11#ChannelRegularConversion=ADC_CHANNEL_TEMPSENSOR
ADC1.Channel-12#ChannelRegularConversion=ADC_CHANNEL_VREFINT
ADC1.ContinuousConvMode=ENABLE
ADC1.DMAContinuousRequests=ENABLE
ADC1.EOCSelection=ADC_EOC_SEQ_CONV
ADC1.ExternalTrigConv=ADC_SOFTWARE_START
ADC1.ExternalTrigConvEdge=ADC_EXTERNALTRIGCONVEDGE_NONE
ADC1.NbrOfConversion=13
ADC1.Resolution=ADC_RESOLUTION_12B
ADC1.SamplingTimeCommon=ADC_SAMPLETIME_480CYCLES
ADC1.ScanConvMode=ENABLE
CAN1.IPParameters=AutoRetransmission,BxCANMode,Prescaler,SyncJumpWidth,TimeSeg1,TimeSeg2
CAN1.AutoRetransmission=ENABLE
CAN1.BxCANMode=Normal
CAN1.Prescaler=12
CAN1.SyncJumpWidth=1tq
CAN1.TimeSeg1=11tq
CAN1.TimeSeg2=2tq
TIM4.Channel-PWM=CH1
TIM4.Channel-PWM=CH2
TIM4.Channel-PWM=CH3
TIM4.Prescaler=0
TIM4.Period=8399
GPIO.groupedSignals=NSS,ETH_MDIO,ETH_MDC,ETH_RMII_REF_CLK,ETH_RMII_MDIO,ETH_RMII_MDC,ETH_RMII_CRS_DV,ETH_RMII_RXD0,ETH_RMII_RXD1,ETH_RMII_TX_EN,ETH_RMII_TXD0,ETH_RMII_TXD1,USART1_TX,USART1_RX
Mcu.Family=STM32F4
Mcu.Name=STM32F407V(E-G)Tx
Mcu.Package=LQFP100
Mcu.IP0=ADC1
Mcu.IP1=CAN1
Mcu.IP2=ETH
Mcu.IP3=FREERTOS
Mcu.IP4=LWIP
Mcu.IP5=TIM4
Mcu.UserConstants=
Mcu.UserName=STM32F407VETx
ProjectManager.NoMain=0
ProjectManager.FreePins=Keep
ioc.Version=6.9.2
